# Brewfile - managed by brew bundle
# Run `brew bundle` to install all packages
# Test comment for git-spice validation
# Second test comment

# Shell
brew "fish"

# Shell tools
brew "shellcheck"
brew "atuin"
brew "bat"
brew "bottom"
brew "direnv"
brew "fd"
brew "fzf"
brew "glow"
brew "lsd"
brew "ripgrep"
brew "starship"
brew "zellij"
brew "zoxide"

# Benchmarking
brew "hyperfine"

# Git
brew "git-delta"
brew "git-spice"
brew "gitui"
brew "lazygit"

# Languages & runtimes
brew "deno"
brew "rustup"
brew "go"
brew "node"
brew "pnpm"
brew "typescript-language-server"

# Cloud & infrastructure
cask "gcloud-cli"
brew "kubectl", link: false  # kubernetes-cli formula
brew "terraform"

# Formatters
brew "oxfmt"
brew "stylua"

# Editors
brew "neovim"
brew "tree-sitter-cli"

# Containers
cask "orbstack"
