aaron-bond.better-comments
alefragnani.project-manager
anthropic.claude-code
anysphere.remote-ssh
bierner.markdown-preview-github-styles
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
cardinal90.multi-cursor-case-preserve
dbaeumer.vscode-eslint
denoland.vscode-deno
docker.docker
eamodio.gitlens
esbenp.prettier-vscode
fabiospampinato.vscode-open-in-github
foxundermoon.shell-format
github.github-vscode-theme
github.vscode-github-actions
golang.go
graphql.vscode-graphql-syntax
hashicorp.terraform
jnoortheen.nix-ide
johnnymorganz.stylua
meganrogge.template-string-converter
mkhl.direnv
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
oxc.oxc-vscode
redhat.vscode-yaml
ryuta46.multi-command
stivo.tailwind-fold
stkb.rewrap
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
terrastruct.d2
tim-koehler.helm-intellisense
timonwong.shellcheck
usernamehw.errorlens
vscode-icons-team.vscode-icons
vscodevim.vim
yzhang.markdown-all-in-one
zxh404.vscode-proto3
